{
  "_name_or_path": "facebook/vit-mae-base",
  "architectures": [
    "ViTMAEForPreTraining"
  ],
  "attention_probs_dropout_prob": 0.0,
  "decoder_hidden_size": 1024,
  "decoder_intermediate_size": 4096,
  "decoder_num_attention_heads": 16,
  "decoder_num_hidden_layers": 24,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 768,
  "image_size": 384,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "layer_norm_eps": 1e-12,
  "mask_ratio": 0.75,
  "model_type": "vit_mae",
  "norm_pix_loss": false,
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_hidden_layers": 12,
  "patch_size": "SHOULD BE RELOADED",
  "qkv_bias": true,
  "torch_dtype": "float32",
  "transformers_version": "4.42.3"
}
