{
  "metadata": {
    "total_size": 5675987200
  },
  "weight_map": {
    "blocks.0.attn1.norm_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.0.attn1.norm_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.0.attn1.to_k.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.0.attn1.to_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.0.attn1.to_out.0.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.0.attn1.to_out.0.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.0.attn1.to_q.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.0.attn1.to_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.0.attn1.to_v.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.0.attn1.to_v.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.0.attn2.norm_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.0.attn2.norm_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.0.attn2.to_k.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.0.attn2.to_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.0.attn2.to_out.0.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.0.attn2.to_out.0.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.0.attn2.to_q.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.0.attn2.to_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.0.attn2.to_v.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.0.attn2.to_v.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.0.ffn.net.0.proj.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.0.ffn.net.0.proj.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.0.ffn.net.2.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.0.ffn.net.2.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.0.norm2.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.0.norm2.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.0.scale_shift_table": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.1.attn1.norm_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.1.attn1.norm_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.1.attn1.to_k.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.1.attn1.to_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.1.attn1.to_out.0.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.1.attn1.to_out.0.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.1.attn1.to_q.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.1.attn1.to_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.1.attn1.to_v.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.1.attn1.to_v.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.1.attn2.norm_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.1.attn2.norm_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.1.attn2.to_k.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.1.attn2.to_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.1.attn2.to_out.0.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.1.attn2.to_out.0.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.1.attn2.to_q.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.1.attn2.to_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.1.attn2.to_v.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.1.attn2.to_v.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.1.ffn.net.0.proj.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.1.ffn.net.0.proj.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.1.ffn.net.2.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.1.ffn.net.2.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.1.norm2.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.1.norm2.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.1.scale_shift_table": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.10.attn1.norm_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.10.attn1.norm_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.10.attn1.to_k.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.10.attn1.to_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.10.attn1.to_out.0.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.10.attn1.to_out.0.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.10.attn1.to_q.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.10.attn1.to_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.10.attn1.to_v.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.10.attn1.to_v.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.10.attn2.norm_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.10.attn2.norm_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.10.attn2.to_k.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.10.attn2.to_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.10.attn2.to_out.0.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.10.attn2.to_out.0.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.10.attn2.to_q.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.10.attn2.to_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.10.attn2.to_v.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.10.attn2.to_v.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.10.ffn.net.0.proj.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.10.ffn.net.0.proj.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.10.ffn.net.2.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.10.ffn.net.2.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.10.norm2.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.10.norm2.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.10.scale_shift_table": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.11.attn1.norm_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.11.attn1.norm_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.11.attn1.to_k.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.11.attn1.to_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.11.attn1.to_out.0.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.11.attn1.to_out.0.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.11.attn1.to_q.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.11.attn1.to_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.11.attn1.to_v.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.11.attn1.to_v.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.11.attn2.norm_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.11.attn2.norm_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.11.attn2.to_k.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.11.attn2.to_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.11.attn2.to_out.0.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.11.attn2.to_out.0.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.11.attn2.to_q.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.11.attn2.to_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.11.attn2.to_v.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.11.attn2.to_v.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.11.ffn.net.0.proj.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.11.ffn.net.0.proj.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.11.ffn.net.2.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.11.ffn.net.2.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.11.norm2.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.11.norm2.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.11.scale_shift_table": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.12.attn1.norm_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.12.attn1.norm_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.12.attn1.to_k.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.12.attn1.to_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.12.attn1.to_out.0.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.12.attn1.to_out.0.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.12.attn1.to_q.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.12.attn1.to_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.12.attn1.to_v.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.12.attn1.to_v.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.12.attn2.norm_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.12.attn2.norm_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.12.attn2.to_k.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.12.attn2.to_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.12.attn2.to_out.0.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.12.attn2.to_out.0.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.12.attn2.to_q.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.12.attn2.to_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.12.attn2.to_v.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.12.attn2.to_v.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.12.ffn.net.0.proj.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.12.ffn.net.0.proj.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.12.ffn.net.2.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.12.ffn.net.2.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.12.norm2.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.12.norm2.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.12.scale_shift_table": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.13.attn1.norm_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.13.attn1.norm_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.13.attn1.to_k.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.13.attn1.to_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.13.attn1.to_out.0.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.13.attn1.to_out.0.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.13.attn1.to_q.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.13.attn1.to_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.13.attn1.to_v.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.13.attn1.to_v.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.13.attn2.norm_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.13.attn2.norm_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.13.attn2.to_k.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.13.attn2.to_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.13.attn2.to_out.0.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.13.attn2.to_out.0.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.13.attn2.to_q.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.13.attn2.to_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.13.attn2.to_v.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.13.attn2.to_v.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.13.ffn.net.0.proj.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.13.ffn.net.0.proj.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.13.ffn.net.2.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.13.ffn.net.2.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.13.norm2.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.13.norm2.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.13.scale_shift_table": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.14.attn1.norm_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.14.attn1.norm_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.14.attn1.to_k.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.14.attn1.to_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.14.attn1.to_out.0.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.14.attn1.to_out.0.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.14.attn1.to_q.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.14.attn1.to_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.14.attn1.to_v.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.14.attn1.to_v.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.14.attn2.norm_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.14.attn2.norm_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.14.attn2.to_k.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.14.attn2.to_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.14.attn2.to_out.0.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.14.attn2.to_out.0.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.14.attn2.to_q.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.14.attn2.to_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.14.attn2.to_v.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.14.attn2.to_v.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.14.ffn.net.0.proj.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.14.ffn.net.0.proj.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.14.ffn.net.2.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.14.ffn.net.2.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.14.norm2.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.14.norm2.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.14.scale_shift_table": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.15.attn1.norm_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.15.attn1.norm_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.15.attn1.to_k.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.15.attn1.to_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.15.attn1.to_out.0.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.15.attn1.to_out.0.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.15.attn1.to_q.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.15.attn1.to_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.15.attn1.to_v.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.15.attn1.to_v.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.15.attn2.norm_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.15.attn2.norm_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.15.attn2.to_k.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.15.attn2.to_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.15.attn2.to_out.0.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.15.attn2.to_out.0.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.15.attn2.to_q.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.15.attn2.to_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.15.attn2.to_v.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.15.attn2.to_v.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.15.ffn.net.0.proj.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.15.ffn.net.0.proj.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.15.ffn.net.2.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.15.ffn.net.2.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.15.norm2.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.15.norm2.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.15.scale_shift_table": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.16.attn1.norm_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.16.attn1.norm_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.16.attn1.to_k.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.16.attn1.to_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.16.attn1.to_out.0.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.16.attn1.to_out.0.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.16.attn1.to_q.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.16.attn1.to_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.16.attn1.to_v.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.16.attn1.to_v.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.16.attn2.norm_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.16.attn2.norm_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.16.attn2.to_k.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.16.attn2.to_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.16.attn2.to_out.0.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.16.attn2.to_out.0.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.16.attn2.to_q.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.16.attn2.to_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.16.attn2.to_v.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.16.attn2.to_v.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.16.ffn.net.0.proj.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.16.ffn.net.0.proj.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.16.ffn.net.2.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.16.ffn.net.2.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.16.norm2.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.16.norm2.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.16.scale_shift_table": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.17.attn1.norm_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.17.attn1.norm_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.17.attn1.to_k.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.17.attn1.to_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.17.attn1.to_out.0.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.17.attn1.to_out.0.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.17.attn1.to_q.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.17.attn1.to_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.17.attn1.to_v.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.17.attn1.to_v.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.17.attn2.norm_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.17.attn2.norm_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.17.attn2.to_k.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.17.attn2.to_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.17.attn2.to_out.0.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.17.attn2.to_out.0.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.17.attn2.to_q.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.17.attn2.to_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.17.attn2.to_v.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.17.attn2.to_v.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.17.ffn.net.0.proj.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.17.ffn.net.0.proj.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.17.ffn.net.2.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.17.ffn.net.2.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.17.norm2.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.17.norm2.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.17.scale_shift_table": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.18.attn1.norm_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.18.attn1.norm_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.18.attn1.to_k.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.18.attn1.to_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.18.attn1.to_out.0.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.18.attn1.to_out.0.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.18.attn1.to_q.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.18.attn1.to_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.18.attn1.to_v.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.18.attn1.to_v.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.18.attn2.norm_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.18.attn2.norm_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.18.attn2.to_k.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.18.attn2.to_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.18.attn2.to_out.0.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.18.attn2.to_out.0.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.18.attn2.to_q.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.18.attn2.to_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.18.attn2.to_v.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.18.attn2.to_v.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.18.ffn.net.0.proj.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.18.ffn.net.0.proj.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.18.ffn.net.2.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.18.ffn.net.2.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.18.norm2.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.18.norm2.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.18.scale_shift_table": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.19.attn1.norm_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.19.attn1.norm_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.19.attn1.to_k.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.19.attn1.to_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.19.attn1.to_out.0.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.19.attn1.to_out.0.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.19.attn1.to_q.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.19.attn1.to_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.19.attn1.to_v.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.19.attn1.to_v.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.19.attn2.norm_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.19.attn2.norm_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.19.attn2.to_k.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.19.attn2.to_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.19.attn2.to_out.0.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.19.attn2.to_out.0.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.19.attn2.to_q.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.19.attn2.to_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.19.attn2.to_v.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.19.attn2.to_v.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.19.ffn.net.0.proj.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.19.ffn.net.0.proj.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.19.ffn.net.2.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.19.ffn.net.2.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.19.norm2.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.19.norm2.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.19.scale_shift_table": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.2.attn1.norm_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.2.attn1.norm_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.2.attn1.to_k.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.2.attn1.to_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.2.attn1.to_out.0.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.2.attn1.to_out.0.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.2.attn1.to_q.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.2.attn1.to_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.2.attn1.to_v.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.2.attn1.to_v.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.2.attn2.norm_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.2.attn2.norm_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.2.attn2.to_k.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.2.attn2.to_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.2.attn2.to_out.0.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.2.attn2.to_out.0.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.2.attn2.to_q.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.2.attn2.to_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.2.attn2.to_v.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.2.attn2.to_v.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.2.ffn.net.0.proj.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.2.ffn.net.0.proj.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.2.ffn.net.2.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.2.ffn.net.2.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.2.norm2.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.2.norm2.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.2.scale_shift_table": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.20.attn1.norm_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.20.attn1.norm_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.20.attn1.to_k.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.20.attn1.to_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.20.attn1.to_out.0.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.20.attn1.to_out.0.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.20.attn1.to_q.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.20.attn1.to_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.20.attn1.to_v.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.20.attn1.to_v.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.20.attn2.norm_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.20.attn2.norm_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.20.attn2.to_k.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.20.attn2.to_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.20.attn2.to_out.0.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.20.attn2.to_out.0.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.20.attn2.to_q.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.20.attn2.to_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.20.attn2.to_v.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.20.attn2.to_v.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.20.ffn.net.0.proj.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.20.ffn.net.0.proj.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.20.ffn.net.2.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.20.ffn.net.2.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.20.norm2.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.20.norm2.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.20.scale_shift_table": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.21.attn1.norm_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.21.attn1.norm_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.21.attn1.to_k.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.21.attn1.to_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.21.attn1.to_out.0.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.21.attn1.to_out.0.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.21.attn1.to_q.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.21.attn1.to_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.21.attn1.to_v.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.21.attn1.to_v.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.21.attn2.norm_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.21.attn2.norm_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.21.attn2.to_k.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.21.attn2.to_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.21.attn2.to_out.0.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.21.attn2.to_out.0.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.21.attn2.to_q.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.21.attn2.to_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.21.attn2.to_v.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.21.attn2.to_v.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.21.ffn.net.0.proj.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.21.ffn.net.0.proj.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.21.ffn.net.2.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.21.ffn.net.2.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.21.norm2.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.21.norm2.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.21.scale_shift_table": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.22.attn1.norm_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.22.attn1.norm_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.22.attn1.to_k.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.22.attn1.to_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.22.attn1.to_out.0.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.22.attn1.to_out.0.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.22.attn1.to_q.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.22.attn1.to_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.22.attn1.to_v.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.22.attn1.to_v.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.22.attn2.norm_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.22.attn2.norm_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.22.attn2.to_k.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.22.attn2.to_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.22.attn2.to_out.0.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.22.attn2.to_out.0.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.22.attn2.to_q.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.22.attn2.to_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.22.attn2.to_v.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.22.attn2.to_v.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.22.ffn.net.0.proj.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.22.ffn.net.0.proj.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.22.ffn.net.2.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.22.ffn.net.2.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.22.norm2.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.22.norm2.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.22.scale_shift_table": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.23.attn1.norm_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.23.attn1.norm_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.23.attn1.to_k.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.23.attn1.to_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.23.attn1.to_out.0.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.23.attn1.to_out.0.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.23.attn1.to_q.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.23.attn1.to_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.23.attn1.to_v.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.23.attn1.to_v.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.23.attn2.norm_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.23.attn2.norm_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.23.attn2.to_k.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.23.attn2.to_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.23.attn2.to_out.0.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.23.attn2.to_out.0.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.23.attn2.to_q.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.23.attn2.to_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.23.attn2.to_v.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.23.attn2.to_v.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.23.ffn.net.0.proj.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.23.ffn.net.0.proj.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.23.ffn.net.2.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.23.ffn.net.2.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.23.norm2.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.23.norm2.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.23.scale_shift_table": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.24.attn1.norm_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.24.attn1.norm_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.24.attn1.to_k.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.24.attn1.to_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.24.attn1.to_out.0.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.24.attn1.to_out.0.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.24.attn1.to_q.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.24.attn1.to_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.24.attn1.to_v.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.24.attn1.to_v.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.24.attn2.norm_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.24.attn2.norm_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.24.attn2.to_k.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.24.attn2.to_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.24.attn2.to_out.0.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.24.attn2.to_out.0.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.24.attn2.to_q.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.24.attn2.to_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.24.attn2.to_v.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.24.attn2.to_v.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.24.ffn.net.0.proj.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.24.ffn.net.0.proj.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.24.ffn.net.2.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.24.ffn.net.2.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.24.norm2.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.24.norm2.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.24.scale_shift_table": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.25.attn1.norm_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.25.attn1.norm_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.25.attn1.to_k.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.25.attn1.to_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.25.attn1.to_out.0.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.25.attn1.to_out.0.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.25.attn1.to_q.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.25.attn1.to_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.25.attn1.to_v.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.25.attn1.to_v.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.25.attn2.norm_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.25.attn2.norm_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.25.attn2.to_k.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.25.attn2.to_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.25.attn2.to_out.0.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.25.attn2.to_out.0.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.25.attn2.to_q.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.25.attn2.to_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.25.attn2.to_v.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.25.attn2.to_v.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.25.ffn.net.0.proj.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.25.ffn.net.0.proj.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.25.ffn.net.2.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.25.ffn.net.2.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.25.norm2.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.25.norm2.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.25.scale_shift_table": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.26.attn1.norm_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.26.attn1.norm_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.26.attn1.to_k.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.26.attn1.to_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.26.attn1.to_out.0.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.26.attn1.to_out.0.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.26.attn1.to_q.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.26.attn1.to_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.26.attn1.to_v.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.26.attn1.to_v.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.26.attn2.norm_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.26.attn2.norm_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.26.attn2.to_k.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.26.attn2.to_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.26.attn2.to_out.0.bias": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "blocks.26.attn2.to_out.0.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "blocks.26.attn2.to_q.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.26.attn2.to_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.26.attn2.to_v.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.26.attn2.to_v.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.26.ffn.net.0.proj.bias": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "blocks.26.ffn.net.0.proj.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "blocks.26.ffn.net.2.bias": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "blocks.26.ffn.net.2.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "blocks.26.norm2.bias": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "blocks.26.norm2.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "blocks.26.scale_shift_table": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "blocks.27.attn1.norm_k.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "blocks.27.attn1.norm_q.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "blocks.27.attn1.to_k.bias": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "blocks.27.attn1.to_k.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "blocks.27.attn1.to_out.0.bias": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "blocks.27.attn1.to_out.0.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "blocks.27.attn1.to_q.bias": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "blocks.27.attn1.to_q.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "blocks.27.attn1.to_v.bias": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "blocks.27.attn1.to_v.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "blocks.27.attn2.norm_k.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "blocks.27.attn2.norm_q.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "blocks.27.attn2.to_k.bias": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "blocks.27.attn2.to_k.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "blocks.27.attn2.to_out.0.bias": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "blocks.27.attn2.to_out.0.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "blocks.27.attn2.to_q.bias": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "blocks.27.attn2.to_q.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "blocks.27.attn2.to_v.bias": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "blocks.27.attn2.to_v.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "blocks.27.ffn.net.0.proj.bias": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "blocks.27.ffn.net.0.proj.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
